; domain
(define (domain recharging-robots)
(:requirements :typing :adl :action-costs)
(:types
    location - object
    robot - object
    battery-level - object
    config - object
)

(:predicates
    ;; The remaining battery of the robot
    (battery ?r - robot ?f - battery-level)
    ;; Robot is located at the given location
    (at ?r - robot ?l - location)
    ;; Two locations are connected in the graph of locations
    (CONNECTED ?l1 - location ?l2 - location)
    ;; Robot stopped and is guarding all locations connected to the
    ;; location where robot is located
    (stopped ?r - robot)
    ;; Location ?l is guarded by at least one robot
    (guarded ?l - location)
    ;; ?f1 is predecessor of ?f2 in the battery level, i.e., ?f2 = ?f1 + 1
    (BATTERY-PREDECESSOR ?f1 - battery-level ?f2 - battery-level)
    ;; Definition of a guarding configuration, i.e., one atom per location
    ;; in each configuration
    (GUARD-CONFIG ?c - config ?l - location)
    ;; Configuration is fullfilled, i.e., all of its locations were guarded
    ;; at some point.
    (config-fullfilled ?c - config)
)

(:functions
    (move-cost) - number
    (recharge-cost) - number
    (total-cost) - number
)

;; Move the robot ?r from the location ?from to the location ?to while
;; consuming the battery -- it is decreased by one from ?fpre to ?fpost
(:action move
    :parameters (?r - robot ?from - location ?to - location
                 ?fpre - battery-level ?fpost - battery-level)
    :precondition
        (and
            (not (stopped ?r))
            (at ?r ?from)
            (battery ?r ?fpre)
            (BATTERY-PREDECESSOR ?fpost ?fpre)
            (or (CONNECTED ?from ?to) (CONNECTED ?to ?from))
        )
    :effect
        (and
            (not (at ?r ?from))
            (at ?r ?to)
            (not (battery ?r ?fpre))
            (battery ?r ?fpost)
            (increase (total-cost) (move-cost))
        )
)

;; Recharge robot ?rto at location ?loc by transfering one unit of battery
;; charge from the robot ?rfrom
(:action recharge
    :parameters (?rfrom - robot ?rto - robot ?loc - location
                 ?fpre-from - battery-level ?fpost-from - battery-level
                 ?fpre-to - battery-level ?fpost-to - battery-level)
    :precondition
        (and
            (not (= ?rfrom ?rto))
            (at ?rfrom ?loc)
            (at ?rto ?loc)
            (battery ?rfrom ?fpre-from)
            (battery ?rto ?fpre-to)
            (BATTERY-PREDECESSOR ?fpost-from ?fpre-from)
            (BATTERY-PREDECESSOR ?fpre-to ?fpost-to)
        )
    :effect
        (and
            (not (battery ?rfrom ?fpre-from))
            (battery ?rfrom ?fpost-from)
            (not (battery ?rto ?fpre-to))
            (battery ?rto ?fpost-to)
            (increase (total-cost) (recharge-cost))
        )
)

;; Stop the robot at its current location and guard the neighborhood.
;; Once the robot stopped it can move again only when the configuration is
;; fullfilled, i.e., stopping too early can result in a dead-end.
;; Note that the conditional effect can be compiled away without blow-up,
;; because it is conditioned on a static predicates.
(:action stop-and-guard
    :parameters (?r - robot ?l - location)
    :precondition
        (and
            (not (stopped ?r))
            (at ?r ?l)
        )
    :effect
        (and
            (stopped ?r)
            (guarded ?l)
            (forall (?l2 - location)
                (when (or (CONNECTED ?l ?l2) (CONNECTED ?l2 ?l))
                      (guarded ?l2)
                )
            )
        )
)

;; Verify that the given configuration is fullfilled, i.e., robots guard
;; all locations from the configuration.
;; Note that this action unblocks all robots whether they participate in
;; guarding of the configuration or not. This simplifies the model because
;; otherwise, we would need to keep track of what location is guarded by
;; which robot (it can be guarded by multiple ones).
;; Also note the precondition does not have to inccur exponential blow-up
;; because the imply condition is conditioned on a static predicate.
(:action verify-guard-config
    :parameters (?c - config)
    :precondition
        (and
            (forall (?l - location)
                (imply (GUARD-CONFIG ?c ?l) (guarded ?l))
            )
        )
    :effect
        (and
            (forall (?r - robot) (not (stopped ?r)))
            (forall (?l - location) (not (guarded ?l)))
            (config-fullfilled ?c)
        )
)

)

; problem
;; Genearated with: generator.py single-source-move-to-locations 5 10 35 1.08 problems/PM03.pddl problems/PM03.plan --random-seed 240
;; Random seed: 240
(define (problem recharge-single-source-move-to-locations-8396)
(:domain recharging-robots)
(:objects
  location-0000 location-0001 location-0002 location-0003 location-0004 location-0005 location-0006 location-0007 location-0008 location-0009 location-0010 location-0011 location-0012 location-0013 location-0014 location-0015 location-0016 location-0017 location-0018 location-0019 location-0020 location-0021 location-0022 location-0023 location-0024 location-0025 location-0026 location-0027 location-0028 location-0029 location-0030 location-0031 location-0032 location-0033 location-0034 location-0035 location-0036 location-0037 location-0038 location-0039 location-0040 location-0041 location-0042 location-0043 location-0044 location-0045 location-0046 location-0047 location-0048 location-0049 location-0050 location-0051 location-0052 location-0053 location-0054 location-0055 location-0056 location-0057 location-0058 location-0059 location-0060 location-0061 location-0062 location-0063 location-0064 location-0065 location-0066 location-0067 location-0068 location-0069 location-0070 location-0071 location-0072 location-0073 location-0074 - location
  robot-00 robot-01 robot-02 robot-03 robot-04 - robot
  battery-0000 battery-0001 battery-0002 battery-0003 battery-0004 battery-0005 battery-0006 battery-0007 battery-0008 battery-0009 battery-0010 battery-0011 battery-0012 battery-0013 battery-0014 battery-0015 battery-0016 battery-0017 battery-0018 battery-0019 battery-0020 battery-0021 battery-0022 battery-0023 battery-0024 battery-0025 battery-0026 battery-0027 battery-0028 battery-0029 battery-0030 battery-0031 battery-0032 battery-0033 - battery-level
)
(:init
  (= (move-cost) 1)
  (= (recharge-cost) 1)
  (= (total-cost) 0)
  (CONNECTED location-0072 location-0073)
  (CONNECTED location-0067 location-0068)
  (CONNECTED location-0043 location-0046)
  (CONNECTED location-0044 location-0045)
  (CONNECTED location-0001 location-0040)
  (CONNECTED location-0007 location-0035)
  (CONNECTED location-0018 location-0035)
  (CONNECTED location-0044 location-0054)
  (CONNECTED location-0059 location-0073)
  (CONNECTED location-0019 location-0064)
  (CONNECTED location-0039 location-0042)
  (CONNECTED location-0040 location-0041)
  (CONNECTED location-0022 location-0035)
  (CONNECTED location-0029 location-0050)
  (CONNECTED location-0028 location-0030)
  (CONNECTED location-0003 location-0040)
  (CONNECTED location-0031 location-0056)
  (CONNECTED location-0021 location-0055)
  (CONNECTED location-0023 location-0061)
  (CONNECTED location-0041 location-0042)
  (CONNECTED location-0010 location-0036)
  (CONNECTED location-0027 location-0052)
  (CONNECTED location-0067 location-0070)
  (CONNECTED location-0004 location-0066)
  (CONNECTED location-0073 location-0074)
  (CONNECTED location-0047 location-0064)
  (CONNECTED location-0010 location-0045)
  (CONNECTED location-0020 location-0022)
  (CONNECTED location-0039 location-0044)
  (CONNECTED location-0000 location-0016)
  (CONNECTED location-0014 location-0033)
  (CONNECTED location-0013 location-0074)
  (CONNECTED location-0047 location-0048)
  (CONNECTED location-0024 location-0028)
  (CONNECTED location-0019 location-0041)
  (CONNECTED location-0001 location-0044)
  (CONNECTED location-0011 location-0046)
  (CONNECTED location-0003 location-0008)
  (CONNECTED location-0028 location-0071)
  (CONNECTED location-0048 location-0049)
  (CONNECTED location-0004 location-0034)
  (CONNECTED location-0012 location-0047)
  (CONNECTED location-0006 location-0070)
  (CONNECTED location-0071 location-0072)
  (CONNECTED location-0047 location-0050)
  (CONNECTED location-0024 location-0030)
  (CONNECTED location-0002 location-0027)
  (CONNECTED location-0042 location-0045)
  (CONNECTED location-0055 location-0072)
  (CONNECTED location-0008 location-0061)
  (CONNECTED location-0005 location-0007)
  (CONNECTED location-0051 location-0068)
  (CONNECTED location-0009 location-0069)
  (CONNECTED location-0049 location-0050)
  (CONNECTED location-0026 location-0066)
  (CONNECTED location-0045 location-0046)
  (CONNECTED location-0055 location-0056)
  (CONNECTED location-0071 location-0074)
  (CONNECTED location-0000 location-0032)
  (CONNECTED location-0005 location-0046)
  (CONNECTED location-0001 location-0039)
  (CONNECTED location-0051 location-0052)
  (CONNECTED location-0019 location-0063)
  (CONNECTED location-0003 location-0012)
  (CONNECTED location-0022 location-0025)
  (CONNECTED location-0005 location-0018)
  (CONNECTED location-0060 location-0073)
  (CONNECTED location-0015 location-0050)
  (CONNECTED location-0012 location-0033)
  (CONNECTED location-0013 location-0062)
  (CONNECTED location-0025 location-0070)
  (CONNECTED location-0002 location-0013)
  (CONNECTED location-0055 location-0058)
  (CONNECTED location-0017 location-0041)
  (CONNECTED location-0056 location-0057)
  (CONNECTED location-0000 location-0034)
  (CONNECTED location-0054 location-0069)
  (CONNECTED location-0019 location-0047)
  (CONNECTED location-0006 location-0022)
  (CONNECTED location-0058 location-0060)
  (CONNECTED location-0051 location-0054)
  (CONNECTED location-0052 location-0053)
  (CONNECTED location-0026 location-0034)
  (CONNECTED location-0005 location-0011)
  (CONNECTED location-0050 location-0065)
  (CONNECTED location-0014 location-0023)
  (CONNECTED location-0057 location-0058)
  (CONNECTED location-0053 location-0054)
  (CONNECTED location-0011 location-0018)
  (CONNECTED location-0017 location-0034)
  (CONNECTED location-0008 location-0040)
  (CONNECTED location-0027 location-0053)
  (CONNECTED location-0011 location-0036)
  (CONNECTED location-0000 location-0036)
  (CONNECTED location-0028 location-0052)
  (CONNECTED location-0021 location-0031)
  (CONNECTED location-0026 location-0063)
  (CONNECTED location-0064 location-0065)
  (CONNECTED location-0029 location-0065)
  (CONNECTED location-0023 location-0058)
  (CONNECTED location-0037 location-0066)
  (CONNECTED location-0015 location-0029)
  (CONNECTED location-0032 location-0045)
  (CONNECTED location-0020 location-0025)
  (CONNECTED location-0060 location-0061)
  (CONNECTED location-0043 location-0054)
  (CONNECTED location-0016 location-0037)
  (CONNECTED location-0044 location-0053)
  (CONNECTED location-0058 location-0073)
  (CONNECTED location-0051 location-0067)
  (CONNECTED location-0004 location-0026)
  (CONNECTED location-0013 location-0059)
  (CONNECTED location-0001 location-0002)
  (CONNECTED location-0027 location-0030)
  (CONNECTED location-0020 location-0046)
  (CONNECTED location-0002 location-0074)
  (CONNECTED location-0009 location-0025)
  (CONNECTED location-0031 location-0055)
  (CONNECTED location-0010 location-0032)
  (CONNECTED location-0034 location-0063)
  (CONNECTED location-0023 location-0060)
  (CONNECTED location-0014 location-0057)
  (CONNECTED location-0009 location-0043)
  (CONNECTED location-0021 location-0072)
  (CONNECTED location-0007 location-0018)
  (CONNECTED location-0012 location-0014)
  (CONNECTED location-0061 location-0062)
  (CONNECTED location-0018 location-0036)
  (CONNECTED location-0024 location-0052)
  (CONNECTED location-0015 location-0049)
  (CONNECTED location-0059 location-0074)
  (CONNECTED location-0030 location-0074)
  (CONNECTED location-0005 location-0020)
  (CONNECTED location-0001 location-0013)
  (CONNECTED location-0003 location-0041)
  (CONNECTED location-0006 location-0067)
  (CONNECTED location-0002 location-0030)
  (CONNECTED location-0024 location-0027)
  (CONNECTED location-0000 location-0042)
  (CONNECTED location-0007 location-0020)
  (CONNECTED location-0035 location-0036)
  (CONNECTED location-0009 location-0054)
  (CONNECTED location-0033 location-0048)
  (CONNECTED location-0021 location-0028)
  (CONNECTED location-0050 location-0064)
  (CONNECTED location-0010 location-0046)
  (CONNECTED location-0033 location-0057)
  (CONNECTED location-0008 location-0012)
  (CONNECTED location-0039 location-0045)
  (CONNECTED location-0036 location-0037)
  (CONNECTED location-0000 location-0017)
  (CONNECTED location-0068 location-0069)
  (CONNECTED location-0009 location-0020)
  (CONNECTED location-0063 location-0064)
  (CONNECTED location-0017 location-0042)
  (CONNECTED location-0040 location-0062)
  (CONNECTED location-0014 location-0061)
  (CONNECTED location-0032 location-0042)
  (CONNECTED location-0007 location-0022)
  (CONNECTED location-0035 location-0038)
  (CONNECTED location-0059 location-0060)
  (CONNECTED location-0069 location-0070)
  (CONNECTED location-0016 location-0034)
  (CONNECTED location-0002 location-0044)
  (CONNECTED location-0017 location-0063)
  (CONNECTED location-0002 location-0053)
  (CONNECTED location-0028 location-0072)
  (CONNECTED location-0008 location-0014)
  (CONNECTED location-0010 location-0011)
  (CONNECTED location-0065 location-0066)
  (CONNECTED location-0000 location-0010)
  (CONNECTED location-0020 location-0043)
  (CONNECTED location-0037 location-0038)
  (CONNECTED location-0012 location-0048)
  (CONNECTED location-0063 location-0066)
  (CONNECTED location-0023 location-0057)
  (CONNECTED location-0041 location-0047)
  (CONNECTED location-0006 location-0025)
  (CONNECTED location-0043 location-0044)
  (CONNECTED location-0059 location-0062)
  (CONNECTED location-0013 location-0040)
  (CONNECTED location-0055 location-0073)
  (CONNECTED location-0016 location-0036)
  (CONNECTED location-0004 location-0016)
  (CONNECTED location-0008 location-0062)
  (CONNECTED location-0039 location-0040)
  (CONNECTED location-0030 location-0071)
  (CONNECTED location-0017 location-0019)
  (CONNECTED location-0051 location-0069)
  (CONNECTED location-0009 location-0070)
  (CONNECTED location-0004 location-0037)
  (CONNECTED location-0003 location-0047)

  (BATTERY-PREDECESSOR battery-0000 battery-0001)
  (BATTERY-PREDECESSOR battery-0001 battery-0002)
  (BATTERY-PREDECESSOR battery-0002 battery-0003)
  (BATTERY-PREDECESSOR battery-0003 battery-0004)
  (BATTERY-PREDECESSOR battery-0004 battery-0005)
  (BATTERY-PREDECESSOR battery-0005 battery-0006)
  (BATTERY-PREDECESSOR battery-0006 battery-0007)
  (BATTERY-PREDECESSOR battery-0007 battery-0008)
  (BATTERY-PREDECESSOR battery-0008 battery-0009)
  (BATTERY-PREDECESSOR battery-0009 battery-0010)
  (BATTERY-PREDECESSOR battery-0010 battery-0011)
  (BATTERY-PREDECESSOR battery-0011 battery-0012)
  (BATTERY-PREDECESSOR battery-0012 battery-0013)
  (BATTERY-PREDECESSOR battery-0013 battery-0014)
  (BATTERY-PREDECESSOR battery-0014 battery-0015)
  (BATTERY-PREDECESSOR battery-0015 battery-0016)
  (BATTERY-PREDECESSOR battery-0016 battery-0017)
  (BATTERY-PREDECESSOR battery-0017 battery-0018)
  (BATTERY-PREDECESSOR battery-0018 battery-0019)
  (BATTERY-PREDECESSOR battery-0019 battery-0020)
  (BATTERY-PREDECESSOR battery-0020 battery-0021)
  (BATTERY-PREDECESSOR battery-0021 battery-0022)
  (BATTERY-PREDECESSOR battery-0022 battery-0023)
  (BATTERY-PREDECESSOR battery-0023 battery-0024)
  (BATTERY-PREDECESSOR battery-0024 battery-0025)
  (BATTERY-PREDECESSOR battery-0025 battery-0026)
  (BATTERY-PREDECESSOR battery-0026 battery-0027)
  (BATTERY-PREDECESSOR battery-0027 battery-0028)
  (BATTERY-PREDECESSOR battery-0028 battery-0029)
  (BATTERY-PREDECESSOR battery-0029 battery-0030)
  (BATTERY-PREDECESSOR battery-0030 battery-0031)
  (BATTERY-PREDECESSOR battery-0031 battery-0032)
  (BATTERY-PREDECESSOR battery-0032 battery-0033)

  (at robot-00 location-0066)
  (battery robot-00 battery-0003)
  (at robot-01 location-0066)
  (battery robot-01 battery-0009)
  (at robot-02 location-0066)
  (battery robot-02 battery-0002)
  (at robot-03 location-0066)
  (battery robot-03 battery-0007)
  (at robot-04 location-0066)
  (battery robot-04 battery-0012)

)
(:goal
  (and
    (at robot-00 location-0056)
    (at robot-01 location-0002)
    (at robot-02 location-0060)
    (at robot-03 location-0032)
    (at robot-04 location-0023)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (recharge robot-01 robot-00 location-0066 battery-0009 battery-0008 battery-0003 battery-0004)
   deleted: (battery robot-01 battery-0009) (battery robot-00 battery-0003)
   added: (battery robot-01 battery-0008) (battery robot-00 battery-0004)
   goals met: 0 of 5
2. (recharge robot-03 robot-00 location-0066 battery-0007 battery-0006 battery-0004 battery-0005)
   deleted: (battery robot-03 battery-0007) (battery robot-00 battery-0004)
   added: (battery robot-03 battery-0006) (battery robot-00 battery-0005)
   goals met: 0 of 5
3. (recharge robot-04 robot-00 location-0066 battery-0012 battery-0011 battery-0005 battery-0006)
   deleted: (battery robot-04 battery-0012) (battery robot-00 battery-0005)
   added: (battery robot-04 battery-0011) (battery robot-00 battery-0006)
   goals met: 0 of 5
4. (recharge robot-01 robot-00 location-0066 battery-0008 battery-0007 battery-0006 battery-0007)
   deleted: (battery robot-01 battery-0008) (battery robot-00 battery-0006)
   added: (battery robot-01 battery-0007) (battery robot-00 battery-0007)
   goals met: 0 of 5
5. (recharge robot-03 robot-00 location-0066 battery-0006 battery-0005 battery-0007 battery-0008)
   deleted: (battery robot-03 battery-0006) (battery robot-00 battery-0007)
   added: (battery robot-03 battery-0005) (battery robot-00 battery-0008)
   goals met: 0 of 5
6. (recharge robot-04 robot-00 location-0066 battery-0011 battery-0010 battery-0008 battery-0009)
   deleted: (battery robot-04 battery-0011) (battery robot-00 battery-0008)
   added: (battery robot-04 battery-0010) (battery robot-00 battery-0009)
   goals met: 0 of 5
7. (recharge robot-00 robot-02 location-0066 battery-0009 battery-0008 battery-0002 battery-0003)
   deleted: (battery robot-00 battery-0009) (battery robot-02 battery-0002)
   added: (battery robot-00 battery-0008) (battery robot-02 battery-0003)
   goals met: 0 of 5
8. (recharge robot-01 robot-02 location-0066 battery-0007 battery-0006 battery-0003 battery-0004)
   deleted: (battery robot-01 battery-0007) (battery robot-02 battery-0003)
   added: (battery robot-01 battery-0006) (battery robot-02 battery-0004)
   goals met: 0 of 5
9. (recharge robot-03 robot-02 location-0066 battery-0005 battery-0004 battery-0004 battery-0005)
   deleted: (battery robot-03 battery-0005) (battery robot-02 battery-0004)
   added: (battery robot-03 battery-0004) (battery robot-02 battery-0005)
   goals met: 0 of 5
10. (recharge robot-04 robot-02 location-0066 battery-0010 battery-0009 battery-0005 battery-0006)
   deleted: (battery robot-04 battery-0010) (battery robot-02 battery-0005)
   added: (battery robot-04 battery-0009) (battery robot-02 battery-0006)
   goals met: 0 of 5
11. (recharge robot-00 robot-02 location-0066 battery-0008 battery-0007 battery-0006 battery-0007)
   deleted: (battery robot-00 battery-0008) (battery robot-02 battery-0006)
   added: (battery robot-00 battery-0007) (battery robot-02 battery-0007)
   goals met: 0 of 5
12. (recharge robot-04 robot-02 location-0066 battery-0009 battery-0008 battery-0007 battery-0008)
   deleted: (battery robot-04 battery-0009) (battery robot-02 battery-0007)
   added: (battery robot-04 battery-0008) (battery robot-02 battery-0008)
   goals met: 0 of 5
13. (move robot-00 location-0066 location-0065 battery-0007 battery-0006)
   deleted: (at robot-00 location-0066) (battery robot-00 battery-0007)
   added: (at robot-00 location-0065) (battery robot-00 battery-0006)
   goals met: 0 of 5
14. (move robot-00 location-0065 location-0050 battery-0006 battery-0005)
   deleted: (at robot-00 location-0065) (battery robot-00 battery-0006)
   added: (at robot-00 location-0050) (battery robot-00 battery-0005)
   goals met: 0 of 5
15. (move robot-00 location-0050 location-0047 battery-0005 battery-0004)
   deleted: (at robot-00 location-0050) (battery robot-00 battery-0005)
   added: (at robot-00 location-0047) (battery robot-00 battery-0004)
   goals met: 0 of 5
16. (move robot-00 location-0047 location-0048 battery-0004 battery-0003)
   deleted: (at robot-00 location-0047) (battery robot-00 battery-0004)
   added: (at robot-00 location-0048) (battery robot-00 battery-0003)
   goals met: 0 of 5
17. (move robot-00 location-0048 location-0033 battery-0003 battery-0002)
   deleted: (at robot-00 location-0048) (battery robot-00 battery-0003)
   added: (at robot-00 location-0033) (battery robot-00 battery-0002)
   goals met: 0 of 5
18. (move robot-00 location-0033 location-0057 battery-0002 battery-0001)
   deleted: (at robot-00 location-0033) (battery robot-00 battery-0002)
   added: (at robot-00 location-0057) (battery robot-00 battery-0001)
   goals met: 0 of 5
19. (move robot-00 location-0057 location-0056 battery-0001 battery-0000)
   deleted: (at robot-00 location-0057) (battery robot-00 battery-0001)
   added: (at robot-00 location-0056) (battery robot-00 battery-0000)
   goals met: 1 of 5
20. (move robot-01 location-0066 location-0037 battery-0006 battery-0005)
   deleted: (at robot-01 location-0066) (battery robot-01 battery-0006)
   added: (at robot-01 location-0037) (battery robot-01 battery-0005)
   goals met: 1 of 5
21. (move robot-01 location-0037 location-0036 battery-0005 battery-0004)
   deleted: (at robot-01 location-0037) (battery robot-01 battery-0005)
   added: (at robot-01 location-0036) (battery robot-01 battery-0004)
   goals met: 1 of 5
22. (move robot-01 location-0036 location-0010 battery-0004 battery-0003)
   deleted: (at robot-01 location-0036) (battery robot-01 battery-0004)
   added: (at robot-01 location-0010) (battery robot-01 battery-0003)
   goals met: 1 of 5
23. (move robot-01 location-0010 location-0045 battery-0003 battery-0002)
   deleted: (at robot-01 location-0010) (battery robot-01 battery-0003)
   added: (at robot-01 location-0045) (battery robot-01 battery-0002)
   goals met: 1 of 5
24. (move robot-01 location-0045 location-0044 battery-0002 battery-0001)
   deleted: (at robot-01 location-0045) (battery robot-01 battery-0002)
   added: (at robot-01 location-0044) (battery robot-01 battery-0001)
   goals met: 1 of 5
25. (move robot-01 location-0044 location-0002 battery-0001 battery-0000)
   deleted: (at robot-01 location-0044) (battery robot-01 battery-0001)
   added: (at robot-01 location-0002) (battery robot-01 battery-0000)
   goals met: 2 of 5
26. (move robot-02 location-0066 location-0065 battery-0008 battery-0007)
   deleted: (at robot-02 location-0066) (battery robot-02 battery-0008)
   added: (at robot-02 location-0065) (battery robot-02 battery-0007)
   goals met: 2 of 5
27. (move robot-02 location-0065 location-0050 battery-0007 battery-0006)
   deleted: (at robot-02 location-0065) (battery robot-02 battery-0007)
   added: (at robot-02 location-0050) (battery robot-02 battery-0006)
   goals met: 2 of 5
28. (move robot-02 location-0050 location-0047 battery-0006 battery-0005)
   deleted: (at robot-02 location-0050) (battery robot-02 battery-0006)
   added: (at robot-02 location-0047) (battery robot-02 battery-0005)
   goals met: 2 of 5
29. (move robot-02 location-0047 location-0012 battery-0005 battery-0004)
   deleted: (at robot-02 location-0047) (battery robot-02 battery-0005)
   added: (at robot-02 location-0012) (battery robot-02 battery-0004)
   goals met: 2 of 5
30. (move robot-02 location-0012 location-0014 battery-0004 battery-0003)
   deleted: (at robot-02 location-0012) (battery robot-02 battery-0004)
   added: (at robot-02 location-0014) (battery robot-02 battery-0003)
   goals met: 2 of 5
31. (move robot-02 location-0014 location-0023 battery-0003 battery-0002)
   deleted: (at robot-02 location-0014) (battery robot-02 battery-0003)
   added: (at robot-02 location-0023) (battery robot-02 battery-0002)
   goals met: 2 of 5
32. (move robot-02 location-0023 location-0060 battery-0002 battery-0001)
   deleted: (at robot-02 location-0023) (battery robot-02 battery-0002)
   added: (at robot-02 location-0060) (battery robot-02 battery-0001)
   goals met: 3 of 5
33. (move robot-03 location-0066 location-0004 battery-0004 battery-0003)
   deleted: (at robot-03 location-0066) (battery robot-03 battery-0004)
   added: (at robot-03 location-0004) (battery robot-03 battery-0003)
   goals met: 3 of 5
34. (move robot-03 location-0004 location-0034 battery-0003 battery-0002)
   deleted: (at robot-03 location-0004) (battery robot-03 battery-0003)
   added: (at robot-03 location-0034) (battery robot-03 battery-0002)
   goals met: 3 of 5
35. (move robot-03 location-0034 location-0000 battery-0002 battery-0001)
   deleted: (at robot-03 location-0034) (battery robot-03 battery-0002)
   added: (at robot-03 location-0000) (battery robot-03 battery-0001)
   goals met: 3 of 5
36. (move robot-03 location-0000 location-0032 battery-0001 battery-0000)
   deleted: (at robot-03 location-0000) (battery robot-03 battery-0001)
   added: (at robot-03 location-0032) (battery robot-03 battery-0000)
   goals met: 4 of 5
37. (move robot-04 location-0066 location-0065 battery-0008 battery-0007)
   deleted: (at robot-04 location-0066) (battery robot-04 battery-0008)
   added: (at robot-04 location-0065) (battery robot-04 battery-0007)
   goals met: 4 of 5
38. (move robot-04 location-0065 location-0050 battery-0007 battery-0006)
   deleted: (at robot-04 location-0065) (battery robot-04 battery-0007)
   added: (at robot-04 location-0050) (battery robot-04 battery-0006)
   goals met: 4 of 5
39. (move robot-04 location-0050 location-0047 battery-0006 battery-0005)
   deleted: (at robot-04 location-0050) (battery robot-04 battery-0006)
   added: (at robot-04 location-0047) (battery robot-04 battery-0005)
   goals met: 4 of 5
40. (move robot-04 location-0047 location-0012 battery-0005 battery-0004)
   deleted: (at robot-04 location-0047) (battery robot-04 battery-0005)
   added: (at robot-04 location-0012) (battery robot-04 battery-0004)
   goals met: 4 of 5
41. (move robot-04 location-0012 location-0014 battery-0004 battery-0003)
   deleted: (at robot-04 location-0012) (battery robot-04 battery-0004)
   added: (at robot-04 location-0014) (battery robot-04 battery-0003)
   goals met: 4 of 5
42. (move robot-04 location-0014 location-0023 battery-0003 battery-0002)
   deleted: (at robot-04 location-0014) (battery robot-04 battery-0003)
   added: (at robot-04 location-0023) (battery robot-04 battery-0002)
   goals met: 5 of 5
